app/Models/DashboardModelUser.php

    public function countPemasukan()
    {
        $db = \Config\Database::connect();
        $builder = $this->db->table('tbltransaksipembelian');
        $builder = $builder->where('username', session()->get('username'));
        $builder->join('tblpaket', 'tblpaket.idPaket =  tbltransaksipembelian.idPaket');
        $builder->selectSum('hargaJual');
        $query = $builder->get();
---
SELECT SUM(`hargaJual`) AS `hargaJual`
FROM `tbltransaksipembelian`
JOIN `tblpaket` ON `tblpaket`.`idPaket` =  `tbltransaksipembelian`.`idPaket`
WHERE `username` = 'Hana'

    public function countPengeluaran()
    {
        $db = \Config\Database::connect();
        $builder = $this->db->table('tbltransaksipembelian');
        $builder = $builder->where('username', session()->get('username'));
        $builder->join('tblpaket', 'tblpaket.idPaket =  tbltransaksipembelian.idPaket');
        $builder->selectSum('harga');
        $query = $builder->get();
---
SELECT SUM(`harga`) AS `harga`
FROM `tbltransaksipembelian`
JOIN `tblpaket` ON `tblpaket`.`idPaket` =  `tbltransaksipembelian`.`idPaket`
WHERE `username` = 'Hana'

    public function countKeuntungan()
    {
        $db = \Config\Database::connect();
        $builder = $this->db->table('tbltransaksipembelian');
        $builder = $builder->where('username', session()->get('username'));
        $builder->join('tblpaket', 'tblpaket.idPaket =  tbltransaksipembelian.idPaket');
        $builder->selectSum('keuntungan');
        $query = $builder->get();
---
SELECT SUM(`keuntungan`) AS `keuntungan`
FROM `tbltransaksipembelian`
JOIN `tblpaket` ON `tblpaket`.`idPaket` =  `tbltransaksipembelian`.`idPaket`
WHERE `username` = 'Hana'

    public function countTransaksi()
    {
        $db = \Config\Database::connect();
        $builder = $this->db->table('tbltransaksipembelian');
        $builder = $builder->where('username', session()->get('username'));
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbltransaksipembelian`
WHERE `username` = 'Hana'