app/Models/DashboardModel.php

    public function countUser()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tbluser');
        $builder->like('role', 'User');
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbluser`
WHERE `role` LIKE '%User%' ESCAPE '!'

    public function countaAdmin()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tbluser');
        $builder->like('role', 'Admin');
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbluser`
WHERE `role` LIKE '%Admin%' ESCAPE '!'

    public function countPemasukan()
    {
        $db = \Config\Database::connect();
        $builder = $this->db->table('tbltransaksipembelian');
        $builder->join('tblpaket', 'tblpaket.idPaket =  tbltransaksipembelian.idPaket');
        $builder->selectSum('hargaJual');
        $query = $builder->get();
---
SELECT SUM(`hargaJual`) AS `hargaJual`
FROM `tbltransaksipembelian`
JOIN `tblpaket` ON `tblpaket`.`idPaket` =  `tbltransaksipembelian`.`idPaket`

    public function countPengeluaran()
    {
        $db = \Config\Database::connect();
        $builder = $this->db->table('tbltransaksipembelian');
        $builder->join('tblpaket', 'tblpaket.idPaket =  tbltransaksipembelian.idPaket');
        $builder->selectSum('harga');
        $query = $builder->get();
---
SELECT SUM(`harga`) AS `harga`
FROM `tbltransaksipembelian`
JOIN `tblpaket` ON `tblpaket`.`idPaket` =  `tbltransaksipembelian`.`idPaket`

    public function countKeuntungan()
    {
        $db = \Config\Database::connect();
        $builder = $this->db->table('tbltransaksipembelian');
        $builder->join('tblpaket', 'tblpaket.idPaket =  tbltransaksipembelian.idPaket');
        $builder->selectSum('keuntungan');
        $query = $builder->get();
---
SELECT SUM(`keuntungan`) AS `keuntungan`
FROM `tbltransaksipembelian`
JOIN `tblpaket` ON `tblpaket`.`idPaket` =  `tbltransaksipembelian`.`idPaket`

    public function countTransaksi()
    {
        $db = \Config\Database::connect();
        $builder = $this->db->table('tbltransaksipembelian');
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbltransaksipembelian`