app/Models/PaketModel.php

    function kategoriDisplay($katakunci = null, $start = 0, $length = 0, $columns = NULL, $orders = NULL)
    {
        // $db = \Config\Database::connect();
        // $builder = $db->table('tblpaket');
        $builder = $this->db->table('tblpaket');
        $builder->join('tbloperator', 'tbloperator.idOperator =  tblpaket.idOperator');
        if ($katakunci) {
            $arr_katakunci = explode(" ", $katakunci);
            for ($x = 0; $x < count($arr_katakunci); $x++) {
                $builder = $builder->orLike('idPaket', $arr_katakunci[$x]);
                // $builder = $builder->orLike('idOperator', $arr_katakunci[$x]);
                $builder = $builder->orLike('namaPaket', $arr_katakunci[$x]);
                $builder = $builder->orLike('harga', $arr_katakunci[$x]);
                $builder = $builder->orLike('hargaJual', $arr_katakunci[$x]);
                $builder = $builder->orLike('keuntungan', $arr_katakunci[$x]);
            }
        }
        if ($start != 0 or $length != 0) {
            $builder = $builder->limit($length, $start);
        }
        if ($orders && $columns) {
            for ($i = 0; $i < count($orders); $i++) {
                $builder = $builder->orderBy($columns[$orders[$i]['column']]['data'], $orders[$i]['dir']);
            }
        }
        return $builder->get()->getResult();
---
SELECT *
FROM `tblpaket`
JOIN `tbloperator` ON `tbloperator`.`idOperator` =  `tblpaket`.`idOperator`
ORDER BY `idPaket` ASC
 LIMIT 10