app/Models/UserModel.php

SELECT *
FROM `tbluser`
ORDER BY `username` ASC
 LIMIT 10
---
    function userDisplay($katakunci = null, $start = 0, $length = 0, $columns = NULL, $orders = NULL)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tbluser');
        if ($katakunci) {
            $arr_katakunci = explode(" ", $katakunci);
            for ($x = 0; $x < count($arr_katakunci); $x++) {
                $builder = $builder->orLike('username', $arr_katakunci[$x]);
                $builder = $builder->orLike('password', $arr_katakunci[$x]);
                $builder = $builder->orLike('nama', $arr_katakunci[$x]);
                $builder = $builder->orLike('role', $arr_katakunci[$x]);
            }
        }
        if ($start != 0 or $length != 0) {
            $builder = $builder->limit($length, $start);
        }
        // $builder = $builder->where('username', session()->get('username'));
        if ($orders && $columns) {
            for ($i = 0; $i < count($orders); $i++) {
                $builder = $builder->orderBy($columns[$orders[$i]['column']]['data'], $orders[$i]['dir']);
            }
        }
        return $builder->get()->getResult();

UPDATE `tbluser` SET `role` = 'Admin'
WHERE `username` = '2011016110005'
---
    public function updateData($id, $data)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tbluser');
        $builder->where('username', $id);
        // return $builder->update($data);
        return $builder->update([
            'role' => $data['role']
        ]);